app/controllers/games_controller.rb

SELECT  "games".* FROM "games"   ORDER BY score DESC LIMIT 20
---
  def index
    @games = Game.all.order("score DESC").limit(20)

INSERT INTO "games" ("created_at", "game_type", "name", "score", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-10-04 04:18:49.927064"], ["game_type", "First Years"], ["name", "aSDasd"], ["score", 3], ["updated_at", "2015-10-04 04:18:49.927064"]]
---
  def create
    @game = Game.create!(game_params)