app/controllers/students_controller.rb

SELECT "students".* FROM "students"  WHERE "students"."year" = '1'
---
  def index_first
    render json: Student.where(year: '1')

SELECT "students".* FROM "students"  WHERE "students"."year" = '3'
---
  def index_third
    render json: Student.where(year: '3')